<template>
    <div>

        <el-button-group>

            <el-button type="primary" v-if="nodeState==0" @click="open">
                <i class="el-icon-caret-right"></i>&nbsp;开始发送

            </el-button>
            <el-button type="warning" v-if="nodeState==1" @click="open">
                <i class="el-icon-loading"></i>&nbsp;正在批量发送...
            </el-button>
            <el-button type="warning" v-if="nodeState==2" @click="open">
                <i class="el-icon-loading"></i>&nbsp;群发完成
            </el-button>

        </el-button-group>
        <el-button-group v-if="nodeState==0">

            <el-button type="text">
                <span style="color:#4C4B4B">&nbsp;&nbsp;&nbsp;&nbsp; 总共
                    <strong>15634</strong> 条信息待发送</span>

            </el-button>
        </el-button-group>

        <el-button-group style="float:right">

            <el-button plain icon="el-icon-upload" @click="centerDialogVisible = true">导入联系人</el-button>
            <el-button plain @click="open1">
                <i class="el-icon-delete"></i>&nbsp;清空数据

            </el-button>
        </el-button-group>
        <el-button-group v-if="nodeState!=0" style="color:#4C4B4B">

            <el-button type="text">
                <span style="color:#4C4B4B">&nbsp;&nbsp;&nbsp;&nbsp; 成功
                    <strong>5135</strong>条, 失败
                    <strong style="color:red">15</strong>条，&nbsp;&nbsp;剩余10条待发送。</span>

            </el-button>
        </el-button-group>

        <div class="data-table">
            <el-table ref="multipleTable" :data="tableData3" tooltip-effect="dark" style="width: 100%" @selection-change="handleSelectionChange">
                <el-table-column type="selection" width="55">
                </el-table-column>
                <el-table-column prop="name" label="姓名" width="120">
                </el-table-column>

                <el-table-column prop="address" label="发送内容" show-overflow-tooltip>
                </el-table-column>
                <el-table-column label="发送状态" width="120"  prop="state" :filters="[{ text: '成功', value: 1 }, { text: '失败', value: 0 }]" :filter-method="filterTag" filter-placement="bottom-end">
                    <template slot-scope="scope">
                        <el-tag :type="scope.row.state == 1 ? 'success' : 'info'" disable-transitions>

                            <template v-if="scope.row.state== 1">发送成功</template>
                            <template v-else>
                                <el-tooltip class="item" effect="dark" :content="scope.row.message" placement="left">
                                    <div>发送失败</div>
                                </el-tooltip>
                            </template>
                        </el-tag>
                    </template>
                </el-table-column>

                <!-- <el-table-column prop="date" label="发送时间" width="120">
                </el-table-column> -->
            </el-table>
            <el-pagination @current-change="handleCurrentChange" :current-page="currentPage4" @size-change="handleSizeChange" layout="total, prev, pager, next" :total="400">
            </el-pagination>
        </div>

        <div class="centen" v-if="dataTable">
            <svg width="332px" height="224px" viewBox="0 0 532 254" version="1.1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink">
                <!-- Generator: Sketch 49.2 (51160) - http://www.bohemiancoding.com/sketch -->
                <desc>Created with Sketch.</desc>
                <defs></defs>
                <g id="Page-1" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                    <g id="无" fill-rule="nonzero">
                        <path d="M305.741811,123.14029 L290.096626,123.14029 L264.855525,81.3891324 C264.820894,81.3194005 264.820894,81.2672708 264.699345,81.1982158 C264.699345,81.1460861 264.699345,81.0770312 264.629743,81.0770312 C264.494586,80.8902625 264.330198,80.726367 264.142868,80.5916156 C263.960491,80.4119084 263.731831,80.2859717 263.482157,80.2277231 C263.412895,80.1062 263.291006,80.1062 263.152142,80.0544088 L263.030253,80.0544088 L195.390973,58.4595075 C215.590509,45.9808737 225.134139,33.6755543 225.32529,33.4328465 C225.565093,33.1065097 225.665043,32.6985616 225.603153,32.2987501 C225.541263,31.8989387 225.322602,31.540016 224.995275,31.3009445 C224.318097,30.7994333 223.361535,30.9390501 222.856964,31.6130458 C222.665813,31.8557536 212.705249,44.6461501 191.549279,57.2287048 L157.21679,46.2577705 C156.620854,46.0839658 155.987455,46.0839658 155.391519,46.2577705 L152.69707,47.1074171 L79.1993335,70.5739103 L40.9728645,70.5739103 C36.8167343,70.8485472 33.5864381,74.2896854 33.5864381,78.4424499 C33.5864381,82.5952143 36.8167343,86.0363525 40.9728645,86.3109894 L44.8495294,86.3109894 L32.2291483,107.420814 L7.89219439,107.420814 C3.53345578,107.420814 0,110.943679 0,115.289353 C0,119.635028 3.53345578,123.157893 7.89219439,123.157893 L22.8420375,123.157893 L16.4793908,133.799123 C16.0554838,134.514115 15.9247356,135.364645 16.1144044,136.173395 C16.3639902,136.965107 16.904207,137.633669 17.626976,138.045325 L43.3892442,151.494452 L43.3892442,191.859433 C43.3892442,192.951449 43.9976681,193.991335 44.9714178,194.528542 L45.9794594,195.083013 L144.196452,250.05853 C144.644763,251.245075 145.793189,252.022222 147.064736,251.999515 C147.308173,251.999515 147.482009,251.999515 147.742762,251.930122 L147.777393,251.930122 C148.038146,251.930122 148.264268,251.999515 148.576968,251.999515 C149.038459,251.976964 149.492033,251.871222 149.915704,251.687414 L262.92602,195.724479 L263.551759,195.412378 C264.596947,194.925272 265.262235,193.876268 265.255482,192.726005 L265.255482,171.547126 L282.778225,171.911018 C287.132182,172.001877 290.735638,168.556531 290.826769,164.215624 C290.9179,159.874717 287.462197,156.282061 283.10824,156.191203 L265.272798,155.827311 L265.272798,147.213722 L285.385416,138.859767 L305.724156,138.859767 C309.830095,138.530751 312.995382,135.114972 312.999995,131.008142 C313.004607,126.901312 309.847,123.478474 305.741811,123.14029 Z M252.947801,83.2085947 L157.268737,118.946218 L157.268737,75.6345542 C168.027243,72.3169739 178.427648,67.9394988 188.316008,62.5669224 L252.947801,83.2089332 L252.947801,83.2085947 Z M157.268737,72.463443 L157.268737,52.653815 L184.282824,61.2846669 C175.624512,65.7938654 166.58494,69.5345565 157.268737,72.463443 Z M151.167522,53.9878617 L151.167522,74.3005075 C138.772924,77.7667947 124.744204,80.3319826 108.820951,81.2161566 C107.980228,81.262984 107.331423,81.9715212 107.361005,82.8105133 C107.415447,83.6148798 108.081967,84.2417876 108.890553,84.2491579 L108.977471,84.2491579 C123.242372,83.4920824 137.3856,81.2202796 151.167183,77.4722957 L151.167183,121.268698 L146.056355,123.140629 L58.8432779,83.4513025 L151.167522,53.9878617 Z M23.3808593,134.162677 L51.5944781,86.9172511 L142.805769,128.374249 L117.843075,183.540344 L48.1697173,147.109802 L23.3808593,134.163016 L23.3808593,134.162677 Z M117.912678,190.42045 C118.639965,190.832273 119.514524,190.895922 120.294086,190.593765 C121.094478,190.303068 121.749402,189.712294 122.119358,188.947278 L144.039932,140.610175 L144.039932,242.900512 L49.5084535,190.109026 L49.5084535,154.683504 L117.912678,190.420789 L117.912678,190.42045 Z M259.188559,190.888602 L150.159141,244.771765 L150.159141,136.277993 L180.388843,180.039868 C181.241044,181.253068 182.753276,181.686354 184.108988,181.131545 L259.188559,149.779249 L259.188559,190.889279 L259.188559,190.888602 Z M261.083093,142.429975 C260.909597,142.49903 260.718446,142.55116 260.544611,142.689947 L184.039386,174.597052 L151.549825,127.593996 L260.944229,86.7439368 L287.888713,131.251199 L261.083433,142.429975 L261.083093,142.429975 Z" id="Shape" fill="#9C9C9C"></path>
                        <path d="M148.440537,252.070715 C148.128855,252.070715 147.885607,252.001473 147.643037,252.001473 L147.608143,252.001473 C147.347956,252.070715 147.174498,252.070715 146.931589,252.070715 C145.662803,252.093483 144.516871,251.314226 144.069533,250.124459 L46.0657944,195 C40.914229,199.88329 38,205.201042 38,210.762162 C38,234.640286 89.9506542,254 154.008808,254 C218.049346,254 270,234.640286 270,210.762162 C270,205.444409 267.294124,200.369684 262.576203,195.660179 L149.811262,251.775417 C149.373037,251.946201 148.910434,252.045886 148.440876,252.070715 L148.440537,252.070715 Z" id="Shape" fill="#E5E5E4"></path>
                        <path d="M261.122489,86 L152,126.918357 L184.408805,174 L260.723865,142.039209 C260.914541,141.90019 261.087944,141.848312 261.261348,141.778803 L288,130.564044 L261.122489,86 Z" id="Shape" fill="#FFFFFF"></path>
                        <path d="M183.940921,181.062756 C182.59788,181.617257 181.050667,181.160847 180.221791,179.965655 L150,136 L150,245 L259,190.865927 L259,149.598474 L183.940921,181.062756 Z" id="Shape" fill="#E5E5E4"></path>
                        <path d="M157.372458,71.9541949 C166.685875,69.0028022 175.720986,65.2287736 184.371998,60.6763002 L157.372458,52 L157.372458,71.9538539 L157.372458,71.9541949 Z M157.372458,118.775393 L253,82.7775777 L188.420317,61.9856217 C179.733228,66.7864669 169.378286,71.3779571 157.390104,75.1487346 L157.390104,118.775393 L157.372458,118.775393 Z M146.148807,123 L151.256883,121.114441 L151.256883,76.999174 C138.886605,80.4207991 124.900392,82.9347644 109.124503,83.8253758 L109.037632,83.8253758 C108.22935,83.8181291 107.562991,83.1866094 107.508568,82.376257 C107.484919,81.97039 107.624215,81.5719415 107.895278,81.270097 C108.166341,80.9682525 108.546535,80.7882186 108.950761,80.7702925 C123.267619,79.9916543 137.458306,77.6560138 151.27419,73.8042933 L151.27419,53.3441003 L59,83.0220525 L146.149147,123 L146.148807,123 Z" id="Shape" fill="#FFFFFF"></path>
                        <path d="M144,242 L144,140 L122.202669,188.200065 C121.682582,189.275974 120.613778,189.979637 119.419722,190.032259 C118.929665,190.032699 118.44766,189.907661 118.019639,189.66906 L50,154.033093 L50,189.358181 L144,242 Z" id="Shape" fill="#E5E5E4"></path>
                        <polygon id="Shape" fill="#FFFFFF" points="118.126123 184 143 128.618519 52.1132358 87 24 134.429887 48.7006601 147.444552"></polygon>
                        <path d="M59.5990247,57 C150.359137,53.2095441 197.172969,3.0520056 197.607396,2.55001442 C198.163665,1.9270045 198.128707,0.974742453 197.503201,0.403790873 C196.877695,-0.167160706 195.921618,-0.132680504 195.365689,0.50756952 C194.896644,0.992320595 148.968973,50.2327533 59.4598726,53.9539108 C58.6236791,54.0094553 57.980064,54.7116253 58.0004721,55.5460848 C58.0543589,56.352362 58.7183145,56.9837223 59.5294486,57 L59.5990247,57 Z" id="Shape" fill="#9C9C9C"></path>
                    </g>
                    <text id="无任何数据" font-family="HanziPenSC-W3, HanziPen SC" font-size="38" font-weight="normal" fill="#4C4B4B">
                        <tspan x="340" y="167">无任何数据</tspan>
                    </text>
                </g>
            </svg>

            <div class="iprom">

                没有联系人，请单击 “ 导入联系人” 按钮进行添加

            </div>
        </div>
        <el-dialog title="上传联系人及内容" :visible.sync="centerDialogVisible" width="410px" center>
            <el-upload class="upload-demo" :limit="1" drag action=".xlsx,.xls" name="myfile" on-success="onSuccess" on-error="onError">
                <i class="el-icon-upload"></i>
                <div class="el-upload__text">将文件拖到此处，或
                    <em>点击上传</em>
                </div>
                <div class="el-upload__tip" slot="tip">只能上传.xlsx,.xls文件，且不超过4MB</div>
            </el-upload>
        </el-dialog>
    </div>
</template>

<script>
import { message } from "element-ui";
export default {
  data() {
    return {
      centerDialogVisible: false,
      dataTable: false,
      nodeState: 0,
      tableData3: [
        {
          date: "2016-05-03",
          name: "王小虎",
          address:
            "上海市普陀区金沙江路 1518 弄上海市普陀区金沙 1518 弄上海市普陀区金沙江路 1518 弄上海市普陀区金沙江路 1518 弄上海市普陀区金沙江路 1518 弄上海市普陀区金沙江路 1518 弄上海市普陀区金沙江路 1518 弄上海市普陀区金沙江路 1518 弄",
          state: 0,
          message: "上海市普陀区金沙江路 1518 弄"
        },
        {
          date: "2016-05-02",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-04",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-01",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 0,
          message: ""
        },
        {
          date: "2016-05-08",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-06",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-07",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-03",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 0,
          message: "上海市普陀区金沙江路 1518 弄"
        },
        {
          date: "2016-05-02",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-04",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-01",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 0,
          message: ""
        },
        {
          date: "2016-05-08",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-06",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-07",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-08",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        },
        {
          date: "2016-05-06",
          name: "王小虎",
          address: "上海市普陀区金沙江路 1518 弄",
          state: 1,
          message: ""
        }
      ],
      currentPage4: 4
    };
  },
  methods: {
    filterTag(value, row) {
      return row.state === value;
    },
    handleSizeChange(val) {
      console.log(`每页 ${val} 条`);
    },
    handleCurrentChange(val) {
      console.log(`当前页: ${val}`);
    },
    open() {
      this.$confirm(
        "此操作将开始批量群发短信，中途不能暂停, 是否继续?",
        "群发确认",
        {
          confirmButtonText: "确定发送",
          cancelButtonText: "取消",
          type: "warning"
        }
      )
        .then(() => {
          this.$message({
            type: "success",
            message: "已开启发送任务!"
          });
          this.nodeState = 1;
        })
        .catch(() => {
          this.$message({
            type: "info",
            message: "已取消删除"
          });
        });
    },
    open1() {
      this.$confirm("将会清除以下全部数据, 是否继续?", "信息清空确认", {
        confirmButtonText: "确定全部删除",
        cancelButtonText: "取消",
        type: "warning"
      })
        .then(() => {
          this.$message({
            type: "success",
            message: "删除成功!"
          });
        })
        .catch(() => {
          this.$message({
            type: "info",
            message: "已取消删除"
          });
        });
    },
    onExceed() {},
    onSuccess() {
      centerDialogVisible = false;
    },
    handleSelectionChange() {},
    onError() {
      this.$message.error("上传处理失败，请稍后再试");
    }
  }
};
</script>

<style>
.centen {
  margin: 30px auto;
  width: 30%;
}
.iprom {
  margin-top: 30px;
  width: 200%;
  margin-left: -20px;
}
.data-table {
  margin-top: 10px;
  border: 1px solid #eee;
}
</style>
